app/controllers/sites_controller.rb

SELECT * FROM "sites"
---
  def index
    @sites = Site.all

SELECT * FROM "sites" WHERE ("sites"."id" = 1)
---
  def show
    @site = Site.find(params[:id])

SELECT * FROM "sites" WHERE ("sites"."id" = 2)
---
  def edit
    @site = Site.find(params[:id])

INSERT INTO "sites" ("slug", "created_at", "updated_at") VALUES('justone', '2009-09-28 05:02:52', '2009-09-28 05:02:52')
---
  def create
    @site = Site.new(params[:site])

    respond_to do |format|
      if @site.save

SELECT * FROM "sites" WHERE ("sites"."id" = 1)
---
  def refresh
    @site = Site.find(params[:id])